Repository: junyu17/Maren
Catalog: Resources/Localizable.xcstrings
Source language: zh_hans
Languages: en, es, ja, ko, zh_hant

source: 按我自己的经验设置
en: Set from my own experience
es: Configurar según mi experiencia
ja: 自分の経験に基づいて設定
ko: 내 경험에 맞춰 직접 설정
zh_hant: 按我自己的經驗設定

source: 按记录先后顺序,纵轴为天数。
en: In logging order; vertical axis is days.
es: En orden de registro; el eje vertical son días.
ja: 記録した順に並んでおり、縦軸は日数です。
ko: 기록한 순서대로 보여 주며, 세로축은 일수예요.
zh_hant: 按記錄先後順序,縱軸為天數。

source: 排卵期
en: Ovulatory
es: Ovulatoria
ko: 배란기

source: 排卵期疼痛
en: Ovulation-phase pain
es: Dolor en la fase ovulatoria
ja: 排卵期の痛み
ko: 배란기 통증

source: 排卵疼痛
en: Ovulation pain
es: Dolor de ovulación
ja: 排卵痛
ko: 배란통

source: 探索你的数据中的关联模式
en: Explore correlation patterns in your data
es: Explora patrones de correlación en tus datos
ja: あなたのデータの関連パターンを見る
ko: 내 데이터 속 상관 패턴 살펴보기
zh_hant: 探索你的資料中的關聯模式

source: 探索你的数据中睡眠、心情、周期阶段、用药之间的关联模式。
en: Explore correlation patterns between sleep, mood, cycle phases, and medication in your data.
es: Explora las correlaciones entre sueño, ánimo, fases del ciclo y medicación en tus datos.
ja: 睡眠・気分・周期のフェーズ・服薬の関連パターンを確認できます。
ko: 내 데이터 속 수면, 기분, 주기 단계, 복용약 사이의 상관 패턴을 살펴보세요.
zh_hant: 探索你的資料中睡眠、心情、週期階段、用藥之間的關聯模式。

source: 探索睡眠、心情、周期阶段、用药打卡之间的关联模式;所有结论均为观察性描述,不构成因果或医学建议。
en: Explore observed patterns among sleep, mood, cycle phases, and medication check-ins. These observations do not establish causation or medical advice.
es: Explora los patrones observados entre sueño, ánimo, fases del ciclo y registros de medicación. Estas observaciones no establecen causalidad ni son consejo médico.
ja: 睡眠・気分・周期のフェーズ・服薬チェックインの間で観察されたパターンを確認できます。これらの観察は因果関係や医学的な助言を示すものではありません。
ko: 수면, 기분, 주기 단계, 복용약 체크인 사이에서 관찰된 패턴을 살펴보세요. 이 관찰 내용은 인과관계나 의학적 조언이 아니에요.
zh_hant: 探索睡眠、心情、週期階段、用藥打卡之間的關聯模式;所有結論均為觀察性描述,不構成因果或醫學建議。

source: 接触自然
en: Time in nature
es: Tiempo en la naturaleza
ja: 自然の中で過ごす
ko: 자연 속에서 보낸 시간
zh_hant: 接觸自然

source: 提前准备
en: Prepare ahead
es: Prepárate con antelación
ja: 事前に準備
ko: 미리 준비하기
zh_hant: 提前準備

source: 提前提醒天数
en: Days before to remind
es: Días de antelación del aviso
ja: 何日前に知らせるか
ko: 미리 알릴 일수
zh_hant: 提前提醒天數

source: 提示
en: Notice
es: Aviso
ja: お知らせ
ko: 알림

source: 提醒
en: Reminders
es: Recordatorios
ja: リマインダー
ko: 알림

source: 提醒在本机生成,不经过服务器。
en: Reminders are generated on your device — never through a server.
es: Los recordatorios se generan en tu dispositivo, nunca a través de un servidor.
ja: リマインダーは端末内で生成され、サーバーを経由することはありません。
ko: 알림은 내 기기에서 만들어지며 서버를 거치지 않아요.
zh_hant: 提醒在本機生成,不經過伺服器。

source: 提醒已达系统上限
en: Too many reminders scheduled
es: Demasiados recordatorios programados
ja: リマインダーの設定数が上限に達しています
ko: 예약된 알림이 너무 많아요
zh_hant: 提醒已達系統上限

source: 提醒时间
en: Reminder time
es: Hora del recordatorio
ja: リマインダーの時間
ko: 알림 시간
zh_hant: 提醒時間

source: 提醒设置已经更新,但未能刷新 Widget 和 Apple Watch。请重新打开 Maren。
en: Reminder settings updated, but Widget and Apple Watch could not be refreshed. Reopen Maren.
es: Ajustes de recordatorio actualizados, pero no se pudieron actualizar el widget ni el Apple Watch. Vuelve a abrir Maren.
ja: リマインダー設定は更新されましたが、ウィジェットとApple Watchを更新できませんでした。Marenを開き直してください。
ko: 알림 설정을 업데이트했지만 위젯과 Apple Watch를 새로 고치지 못했어요. Maren을 다시 열어 주세요.
zh_hant: 提醒設定已經更新,但未能重新整理 Widget 和 Apple Watch。請重新開啟 Maren。

source: 提醒都在你的设备本地生成,不经过任何服务器。
en: All reminders are generated locally on your device — never through a server.
es: Todos los recordatorios se generan localmente en tu dispositivo, nunca a través de un servidor.
ja: すべてのリマインダーは端末内でローカルに生成され、サーバーを経由することはありません。
ko: 모든 알림은 내 기기에서 만들어지며 서버를 거치지 않아요.
zh_hant: 提醒都在你的裝置本地生成,不經過任何伺服器。

source: 搜索
en: Search
es: Buscar
ja: 検索
ko: 검색
zh_hant: 搜尋

source: 搜索文章
en: Search articles
es: Buscar artículos
ja: 記事を検索
ko: 글 검색
zh_hant: 搜尋文章

source: 搜索文章、追踪项、用药和本地记录。
en: Search articles, trackers, medications, and local records.
es: Busca artículos, seguimientos, medicamentos y registros locales.
ja: 記事、トラッカー、薬、ローカルの記録を検索します。
ko: 글, 추적 항목, 복용약, 로컬 기록을 검색해요.
zh_hant: 搜尋文章、追蹤項、用藥和本地記錄。

source: 搜索文章、追踪项、用药和记录
en: Search articles, trackers, medications, and records
es: Buscar artículos, seguimientos, medicamentos y registros
ja: 記事、トラッカー、薬、記録を検索
ko: 글, 추적 항목, 복용약, 기록 검색
zh_hant: 搜尋文章、追蹤項、用藥和記錄

source: 搜索追踪项
en: Search trackers
es: Buscar seguimientos
ja: トラッカーを検索
ko: 추적 항목 검색
zh_hant: 搜尋追蹤項

source: 搜索追踪项…
en: Search trackers…
es: Buscar seguimientos…
ja: トラッカーを検索…
ko: 추적 항목 검색…
zh_hant: 搜尋追蹤項…

source: 支持独立开发
en: Support indie development
es: Apoya el desarrollo independiente
ja: インディー開発を応援
ko: 1인 개발 응원하기
zh_hant: 支援獨立開發

source: 支持类型:%@。睡眠、步数和锻炼时间为只读;每个选中的类型都会在请求时一并申请。Apple 健康不会向 Maren 暴露读权限是否被拒绝,请在「健康」App 中管理权限。数据只在本机与 Apple 健康之间流转,不经过开发者服务器。停止自动同步只会停止后续自动读写,不会替你撤销 Apple 健康权限或删除数据。
en: Supported types: %@. Sleep, step count, and exercise time are read-only; all selected types are requested together. Apple Health does not tell Maren whether read access was denied; manage permissions in the Health app. Data stays between this device and Apple Health and does not pass through a developer server. Stopping automatic sync only stops future reads and writes; it does not revoke Apple Health permissions or delete data.
es: Tipos admitidos: %@. El sueño, los pasos y el tiempo de ejercicio son de solo lectura; todos los tipos seleccionados se solicitan a la vez. Salud de Apple no le indica a Maren si se ha denegado el acceso de lectura; gestiona los permisos en la app Salud. Los datos se quedan entre este dispositivo y Salud de Apple y no pasan por ningún servidor del desarrollador. Detener la sincronización automática solo detiene futuras lecturas y escrituras; no revoca los permisos de Salud de Apple ni elimina datos.
ja: 対応する種類:%@。睡眠、歩数、運動時間は読み取り専用です。選択したすべての種類がまとめて許可を求められます。Apple Healthは読み取り権限が拒否されたかどうかをMarenに伝えないため、「ヘルスケア」Appで権限を管理してください。データはこの端末とApple Healthの間でのみやり取りされ、開発者のサーバーを経由しません。自動同期を停止しても、以後の自動的な読み書きが止まるだけで、Apple Healthの権限を取り消したりデータを削除したりすることはありません。
ko: 지원 유형: %@. 수면, 걸음 수, 운동 시간은 읽기 전용이며, 선택한 모든 유형에 대한 권한을 한꺼번에 요청해요. Apple 건강은 읽기 권한이 거부되었는지 Maren에 알려 주지 않으니, 권한은 건강 앱에서 관리하세요. 데이터는 이 기기와 Apple 건강 사이에서만 오가며 개발자 서버를 거치지 않아요. 자동 동기화를 중지하면 이후의 읽기와 쓰기만 멈추며, Apple 건강 권한이 취소되거나 데이터가 삭제되지는 않아요.
zh_hant: 支援型別:%@。睡眠、步數和鍛鍊時間為只讀;每個選中的型別都會在請求時一併申請。Apple 健康不會向 Maren 暴露讀許可權是否被拒絕,請在「健康」App 中管理許可權。資料只在本機與 Apple 健康之間流轉,不經過開發者伺服器。停止自動同步只會停止後續自動讀寫,不會替你撤銷 Apple 健康許可權或刪除資料。

source: 支持类型:%@。睡眠分析为只读;每个选中的类型都会在请求时一并申请。Apple 健康不会向 Maren 暴露读权限是否被拒绝,请在「健康」App 中管理权限。数据只在本机与 Apple 健康之间流转,不经过开发者服务器。停止自动同步只会停止后续自动读写,不会替你撤销 Apple 健康权限或删除数据。
en: Supported types: %@. Sleep analysis is read-only; all selected types are requested together. Apple Health does not tell Maren whether read access was denied; manage permissions in the Health app. Data stays between this device and Apple Health and does not pass through a developer server. Stopping automatic sync only stops future reads and writes; it does not revoke Apple Health permissions or delete data.
es: Tipos admitidos: %@. El análisis del sueño es de solo lectura; todos los tipos seleccionados se solicitan a la vez. Salud de Apple no le indica a Maren si se ha denegado el acceso de lectura; gestiona los permisos en la app Salud. Los datos se quedan entre este dispositivo y Salud de Apple y no pasan por ningún servidor del desarrollador. Detener la sincronización automática solo detiene futuras lecturas y escrituras; no revoca los permisos de Salud de Apple ni elimina datos.
ja: 対応する種類:%@。睡眠分析は読み取り専用です。選択したすべての種類がまとめて許可を求められます。Apple Healthは読み取り権限が拒否されたかどうかをMarenに伝えないため、「ヘルスケア」Appで権限を管理してください。データはこの端末とApple Healthの間でのみやり取りされ、開発者のサーバーを経由しません。自動同期を停止しても、以後の自動的な読み書きが止まるだけで、Apple Healthの権限を取り消したりデータを削除したりすることはありません。
ko: 지원 유형: %@. 수면 분석은 읽기 전용이며, 선택한 모든 유형에 대한 권한을 한꺼번에 요청해요. Apple 건강은 읽기 권한이 거부되었는지 Maren에 알려 주지 않으니, 권한은 건강 앱에서 관리하세요. 데이터는 이 기기와 Apple 건강 사이에서만 오가며 개발자 서버를 거치지 않아요. 자동 동기화를 중지하면 이후의 읽기와 쓰기만 멈추며, Apple 건강 권한이 취소되거나 데이터가 삭제되지는 않아요.
zh_hant: 支援型別:%@。睡眠分析為只讀;每個選中的型別都會在請求時一併申請。Apple 健康不會向 Maren 暴露讀許可權是否被拒絕,請在「健康」App 中管理許可權。資料只在本機與 Apple 健康之間流轉,不經過開發者伺服器。停止自動同步只會停止後續自動讀寫,不會替你撤銷 Apple 健康許可權或刪除資料。

source: 收藏
en: Bookmark
es: Guardar en marcadores
ja: ブックマーク
ko: 북마크

source: 收藏文章
en: Saved articles
es: Artículos guardados
ja: 保存済みの記事
ko: 저장한 글

source: 放松
en: Relaxation
es: Relajación
ja: リラックス
ko: 이완
zh_hant: 放鬆

source: 教育内容加载为空。
en: No education content is available.
es: No hay contenido educativo disponible.
ja: 教育コンテンツを利用できません。
ko: 교육 콘텐츠가 없어요
zh_hant: 教育內容載入為空。

source: 教育文章列表
en: Education article list
es: Lista de artículos educativos
ja: 教育記事の一覧
ko: 교육 글 목록

source: 数据不足
en: Not enough data
es: Datos insuficientes
ja: データが不足しています
ko: 데이터가 부족해요
zh_hant: 資料不足

source: 数据不足,需要更多记录才能分析此关联。
en: Insufficient data. More records needed to analyze this correlation.
es: Datos insuficientes. Hacen falta más registros para analizar esta correlación.
ja: データが不足しています。この関連を分析するには、より多くの記録が必要です。
ko: 데이터가 부족해요. 이 상관관계를 분석하려면 더 많은 기록이 필요해요.
zh_hant: 資料不足,需要更多記錄才能分析此關聯。

source: 数据备份
en: Data Backup
es: Copia de seguridad de datos
ja: データバックアップ
ko: 데이터 백업
zh_hant: 資料備份

source: 数据导出、备份与删除
en: Data export, backup, and deletion
es: Exportación, copia de seguridad y eliminación de datos
ja: データのエクスポート、バックアップ、削除
ko: 데이터 내보내기, 백업, 삭제
zh_hant: 資料匯出、備份與刪除

source: 数据格式
en: Data format
es: Formato de datos
ja: データ形式
ko: 데이터 형식
zh_hant: 資料格式

source: 文字大小
en: Text size
es: Tamaño del texto
ja: 文字サイズ
ko: 글자 크기

source: 文章
en: Articles
es: Artículos
ja: 記事
ko: 글

source: 断开
en: Disconnect
es: Desconectar
ja: 接続を解除
ko: 연결 해제
zh_hant: 斷開

source: 方法论说明
en: Methodology
es: Metodología
ja: 方法論
ko: 분석 방법
zh_hant: 方法論說明

source: 无
en: None
es: Ninguno
ja: なし
ko: 없음
zh_hant: 無

source: 无法加载本地教育内容，请稍后重试。
en: Unable to load local education content. Please try again later.
es: No se pudo cargar el contenido educativo local. Inténtalo más tarde.
ja: ローカルの教育コンテンツを読み込めませんでした。しばらくしてから再度お試しください。
ko: 로컬 교육 콘텐츠를 불러올 수 없어요. 잠시 후 다시 시도해 주세요.
zh_hant: 無法載入本地教育內容，請稍後重試。

source: 无法完成 Apple 健康同步
en: Unable to complete Apple Health sync
es: No se pudo completar la sincronización con Salud de Apple
ja: Apple Healthとの同期を完了できませんでした
ko: Apple 건강 동기화를 완료할 수 없어요
zh_hant: 無法完成 Apple 健康同步

source: 无法读取本地记录,导出未开始,请重试。
en: Unable to read local records; export did not start. Please try again.
es: No se pudieron leer los registros locales; la exportación no se inició. Inténtalo de nuevo.
ja: ローカルの記録を読み込めなかったため、エクスポートは開始されませんでした。もう一度お試しください。
ko: 로컬 기록을 읽을 수 없어서 내보내기를 시작하지 못했어요. 다시 시도해 주세요.
zh_hant: 無法讀取本地記錄,匯出未開始,請重試。

source: 无法读取这份备份文件,请重试。
en: Unable to read this backup file. Please try again.
es: No se pudo leer este archivo de copia de seguridad. Inténtalo de nuevo.
ja: このバックアップファイルを読み込めませんでした。もう一度お試しください。
ko: 이 백업 파일을 읽을 수 없어요. 다시 시도해 주세요.
zh_hant: 無法讀取這份備份檔案,請重試。

source: 无法读取这份备份文件。
en: Unable to read this backup file.
es: No se pudo leer este archivo de copia de seguridad.
ja: このバックアップファイルを読み込めませんでした。
ko: 이 백업 파일을 읽을 수 없어요.
zh_hant: 無法讀取這份備份檔案。

source: 无法连接 Apple 健康
en: Couldn't connect to Apple Health
es: No se pudo conectar con Salud de Apple
ja: Apple Healthに接続できませんでした
ko: Apple 건강에 연결하지 못했어요
zh_hant: 無法連線 Apple 健康

source: 无限自定义追踪项
en: Unlimited custom trackers
es: Seguimientos personalizados ilimitados
ja: 無制限のカスタムトラッカー
ko: 무제한 사용자 추적 항목
zh_hant: 無限自定義追蹤項

source: 无需打开 App 即可记录经期和心情:
en: Log period flow and mood without opening the app:
es: Registra el flujo del periodo y el ánimo sin abrir la app:
ja: アプリを開かずに経血量と気分を記録:
ko: 앱을 열지 않고도 생리량과 기분을 기록해요:
zh_hant: 無需開啟 App 即可記錄經期和心情:

source: 日
en: day
es: día
ko: 일

source: 日历
en: Calendar
es: Calendario
ja: カレンダー
ko: 캘린더
zh_hant: 日曆

source: 日历概览
en: Calendar Overview
es: Vista general del calendario
ja: カレンダーの概要
ko: 캘린더 개요
zh_hant: 日曆概覽

source: 日期
en: Date
es: Fecha
ja: 日付
ko: 날짜

source: 早醒
en: Early waking
es: Despertar temprano
ja: 早朝覚醒
ko: 이른 새벽 깸

source: 时间
en: Time
es: Hora
ja: 時間
ko: 시간
zh_hant: 時間

source: 易怒
en: Irritable
es: Irritable
ja: イライラ
ko: 짜증

source: 显示模式
en: Appearance
es: Apariencia
ja: 表示モード
ko: 화면 스타일
zh_hant: 顯示模式

source: 显示模式和文字大小仅影响 Maren,不影响系统设置。
en: Appearance and text size affect only Maren, not your system settings.
es: La apariencia y el tamaño del texto solo afectan a Maren, no a los ajustes del sistema.
ja: 表示モードと文字サイズはMarenのみに反映され、システム設定には影響しません。
ko: 화면 스타일과 글자 크기는 Maren에만 적용되며 시스템 설정에는 영향을 주지 않아요.
zh_hant: 顯示模式和文字大小僅影響 Maren,不影響系統設定。

source: 暂无收藏的文章
en: No saved articles
es: No hay artículos guardados
ja: 保存済みの記事はありません
ko: 저장한 글이 없어요
zh_hant: 暫無收藏的文章

source: 暂无收藏的文章。
en: No saved articles.
es: No hay artículos guardados.
ja: 保存済みの記事はありません。
ko: 저장한 글이 없어요.
zh_hant: 暫無收藏的文章。

source: 暂无文章
en: No articles yet
es: Todavía no hay artículos
ja: 記事はまだありません
ko: 아직 글이 없어요
zh_hant: 暫無文章

source: 暂无更早的完成周期可供对比。
en: No earlier completed cycle to compare.
es: No hay un ciclo completado anterior con el que comparar.
ja: 比較できるそれ以前の完了周期がありません。
ko: 비교할 이전 완료 주기가 없어요.
zh_hant: 暫無更早的完成周期可供對比。

source: 暂无每日记录
en: No daily records
es: No hay registros diarios
ja: 日次記録はありません
ko: 일일 기록이 없어요
zh_hant: 暫無每日記錄

source: 暂无每日记录。
en: No daily records.
es: No hay registros diarios.
ja: 日次記録はありません。
ko: 일일 기록이 없어요.
zh_hant: 暫無每日記錄。

source: 暂无用药打卡记录
en: No medication check-ins
es: No hay registros de medicación
ja: 服薬チェックインはありません
ko: 복용 체크인이 없어요
zh_hant: 暫無用藥打卡記錄

source: 暂无用药打卡记录。
en: No medication check-ins.
es: No hay registros de medicación.
ja: 服薬チェックインはありません。
ko: 복용 체크인이 없어요.
zh_hant: 暫無用藥打卡記錄。

source: 暂无经期记录
en: No period records
es: No hay registros de periodo
ja: 生理記録はありません
ko: 생리 기록이 없어요
zh_hant: 暫無經期記錄

source: 暂无经期记录。
en: No period records.
es: No hay registros de periodo.
ja: 生理記録はありません。
ko: 생리 기록이 없어요.
zh_hant: 暫無經期記錄。

source: 暂无记录
en: No records
es: No hay registros
ja: 記録はありません
ko: 기록이 없어요
zh_hant: 暫無記錄

source: 暂无足够记录计算均值。
en: Not enough records to calculate averages.
es: No hay suficientes registros para calcular medias.
ja: 平均値を計算するための記録が足りません。
ko: 평균을 계산하기에는 기록이 부족해요.
zh_hant: 暫無足夠記錄計算均值。

source: 暂时无法加载产品。请确认网络;若在本地测试,请在 Xcode 配置 StoreKit Configuration 文件。
en: Couldn't load products. Check your network; for local testing, configure a StoreKit Configuration file in Xcode.
es: No se pudieron cargar los productos. Comprueba tu conexión; para pruebas locales, configura un archivo StoreKit Configuration en Xcode.
ja: 製品情報を読み込めませんでした。ネットワークをご確認ください。ローカルでテストする場合は、XcodeでStoreKit Configurationファイルを設定してください。
ko: 상품을 불러오지 못했어요. 네트워크를 확인해 주세요. 로컬 테스트라면 Xcode에서 StoreKit 구성 파일을 설정하세요.
zh_hant: 暫時無法載入產品。請確認網路;若在本地測試,請在 Xcode 配置 StoreKit Configuration 檔案。

source: 暂时无法加载产品。请确认网络；若在本地测试，请在 Xcode 配置 StoreKit Configuration 文件。
en: Products are temporarily unavailable. Check your network; for local testing, configure a StoreKit Configuration file in Xcode.
es: Los productos no están disponibles temporalmente. Comprueba tu conexión; para pruebas locales, configura un archivo StoreKit Configuration en Xcode.
ja: 製品情報が一時的に利用できません。ネットワークをご確認ください。ローカルでテストする場合は、XcodeでStoreKit Configurationファイルを設定してください。
ko: 지금은 상품을 이용할 수 없어요. 네트워크를 확인해 주세요. 로컬 테스트라면 Xcode에서 StoreKit 구성 파일을 설정하세요.
zh_hant: 暫時無法載入產品。請確認網路；若在本地測試，請在 Xcode 配置 StoreKit Configuration 檔案。

source: 暂时无法打开本地数据库
en: Can’t open the local database
es: No se puede abrir la base de datos local
ja: ローカルデータベースを開けません
ko: 로컬 데이터베이스를 열 수 없어요
zh_hant: 暫時無法開啟本地資料庫

source: 暂时无法读取这一天的经期记录,未写入新数据。
en: Unable to read this day's period record. No new data was written.
es: No se pudo leer el registro de periodo de este día. No se escribió ningún dato nuevo.
ja: この日の生理記録を読み込めませんでした。新しいデータは書き込まれていません。
ko: 이 날의 생리 기록을 읽을 수 없어요. 새 데이터는 기록되지 않았어요.
zh_hant: 暫時無法讀取這一天的經期記錄,未寫入新資料。

source: 更多 App
en: More apps
es: Más apps
ja: その他のアプリ
ko: 더 많은 앱

source: 更多教育内容
en: More educational content
es: Más contenido educativo
ja: その他の教育コンテンツ
ko: 더 많은 교육 콘텐츠
zh_hant: 更多教育內容

source: 更懂自己的身体节律，不交出健康数据
en: Understand your body's rhythm without giving up your health data
es: Entiende el ritmo de tu cuerpo sin renunciar a tus datos de salud
ja: 健康データを差し出すことなく、自分の体のリズムを理解する
ko: 건강 데이터를 내어주지 않고도 내 몸의 리듬을 이해해 보세요
zh_hant: 更懂自己的身體節律，不交出健康資料

source: 替换会删除本机现有的经期、每日记录、用药、自定义追踪项和打卡历史,且无法撤销。
en: Replacing will permanently delete existing periods, daily logs, medications, custom trackers, and check-in history on this device.
es: Al reemplazar se eliminarán definitivamente los periodos, registros diarios, medicamentos, seguimientos personalizados y el historial de registros de este dispositivo.
ja: 置き換えると、この端末にある既存の生理記録・日次記録・薬・カスタムトラッカー・チェックイン履歴が完全に削除されます。
ko: 바꾸면 이 기기의 기존 생리, 일일 기록, 복용약, 사용자 추적 항목, 체크인 기록이 영구적으로 삭제돼요.
zh_hant: 替換會刪除本機現有的經期、每日記錄、用藥、自定義追蹤項和打卡歷史,且無法撤銷。

source: 替换并导入
en: Replace and Import
es: Reemplazar e importar
ja: 置き換えてインポート
ko: 바꾸고 가져오기
zh_hant: 替換並匯入

source: 替换本机数据
en: Replace local data
es: Reemplazar los datos locales
ja: ローカルデータを置き換え
ko: 로컬 데이터 바꾸기
zh_hant: 替換本機資料

source: 替换模式会删除本机现有记录,需要再次确认。
en: Replace mode deletes existing local records and requires confirmation again.
es: El modo reemplazar elimina los registros locales existentes y pide confirmación otra vez.
ja: 置き換えモードでは既存のローカル記録が削除されるため、再度確認が必要です。
ko: 바꾸기 모드는 기존 로컬 기록을 삭제하며, 한 번 더 확인이 필요해요.
zh_hant: 替換模式會刪除本機現有記錄,需要再次確認。

source: 最划算
en: Best value
es: Mejor precio
ja: 最もお得
ko: 가장 이득이에요

source: 最常记录的追踪项
en: Most-recorded tracker
es: Seguimiento más registrado
ja: 最も記録されたトラッカー
ko: 가장 많이 기록한 추적 항목
zh_hant: 最常記錄的追蹤項

source: 最常记录的追踪项排行
en: Most-recorded trackers
es: Seguimientos más registrados
ja: 記録数の多いトラッカー
ko: 가장 많이 기록한 추적 항목
zh_hant: 最常記錄的追蹤項排行

source: 最近 %lld 个周期长度在 %lld–%lld 天之间波动。
en: Over your last %1$lld cycles, length ranged %2$lld–%3$lld days.
es: En tus últimos %1$lld ciclos, la duración fue de %2$lld a %3$lld días.
ja: 直近%1$lld周期の長さは%2$lld〜%3$lld日の範囲でした。
ko: 최근 %1$lld회 주기의 길이는 %2$lld–%3$lld일 범위였어요.
zh_hant: 最近 %lld 個週期長度在 %lld–%lld 天之間波動。

source: 最近完成周期
en: Latest completed
es: Último completado
ja: 直近の完了周期
ko: 가장 최근에 끝난 주기

source: 最近完成周期 %lld 次
en: Latest completed cycle: %lld times
es: Último ciclo completado: %lld veces
ja: 直近の完了周期:%lld回
ko: 가장 최근에 끝난 주기: %lld회

source: 最近完成周期与历史平均的详细对比:周期长度、经期天数、心情、睡眠、体重、追踪项变化趋势。
en: Compare the latest completed cycle with recent history across cycle length, period days, mood, sleep, weight, and tracker patterns.
es: Compara el último ciclo completado con tu historial reciente en duración, días de periodo, ánimo, sueño, peso y patrones de seguimiento.
ja: 直近の完了周期を、周期の長さ・生理日数・気分・睡眠・体重・トラッカーの傾向について、過去の記録と詳しく比較します。
ko: 가장 최근에 끝난 주기를 최근 기록과 비교해 보세요. 주기 길이, 생리 일수, 기분, 수면, 체중, 추적 항목 패턴을 볼 수 있어요.
zh_hant: 最近完成周期與歷史平均的詳細對比:週期長度、經期天數、心情、睡眠、體重、追蹤項變化趨勢。

source: 最近完成周期变化
en: Latest cycle changes
es: Cambios del último ciclo
ja: 直近の周期の変化
ko: 최근 주기 변화
zh_hant: 最近完成周期變化

source: 最近完成周期变化对比
en: Recent completed cycle comparison
es: Comparación del último ciclo completado
ja: 直近の完了周期の比較
ko: 최근 완료 주기 비교
zh_hant: 最近完成周期變化對比

source: 最近完成周期变化详情
en: Latest cycle change details
es: Detalle de cambios del último ciclo
ja: 直近の周期変化の詳細
ko: 최근 주기 변화 상세
zh_hant: 最近完成周期變化詳情

source: 最近完成周期尚未结束。
en: The latest completed cycle has not ended yet.
es: El último ciclo completado aún no ha terminado.
ja: 直近の周期はまだ終了していません。
ko: 가장 최근 주기가 아직 끝나지 않았어요.
zh_hant: 最近完成周期尚未結束。

source: 月
en: month
es: mes
ko: 월

source: 有
en: Yes
es: Sí
ja: あり
ko: 있음

source: 有一笔交易未能通过签名校验,已跳过。
en: A transaction failed verification and was skipped.
es: Una transacción no superó la verificación y se omitió.
ja: 1件の取引が検証に失敗したため、スキップされました。
ko: 확인에 실패한 거래가 있어 건너뛰었어요.
zh_hant: 有一筆交易未能通過簽名校驗,已跳過。

source: 有备注
en: Has a note
es: Tiene una nota
ja: メモあり
ko: 메모 있음
zh_hant: 有備註

source: 有外部更新影响了当前日期的记录。你要重新加载还是保留未保存的修改？
en: An external update changed today's record. Reload it or keep your unsaved changes?
es: Una actualización externa ha cambiado el registro de hoy. ¿Quieres recargarlo o conservar tus cambios sin guardar?
ja: 外部からの更新により今日の記録が変更されました。再読み込みしますか、それとも未保存の変更を保持しますか?
ko: 외부 업데이트로 오늘 기록이 바뀌었어요. 다시 불러올까요, 저장하지 않은 내 변경 내용을 유지할까요?
zh_hant: 有外部更新影響了當前日期的記錄。你要重新載入還是保留未儲存的修改？

source: 有记录的天数
en: Recorded days
es: Días registrados
ja: 記録した日数
ko: 기록한 날
zh_hant: 有記錄的天數

source: 期
en: term
es: periodo
ko: 기

source: 未开启提醒
en: Reminder off
es: Recordatorio desactivado
ja: リマインダーオフ
ko: 알림 꺼짐
zh_hant: 未開啟提醒

source: 未收藏
en: Not bookmarked
es: Sin marcador
ja: ブックマークなし
ko: 북마크 안 함

source: 未知文章
en: Unknown article
es: Artículo desconocido
ja: 不明な記事
ko: 알 수 없는 글

source: 未能从 Apple Health 删除由 Maren 写入的对应样本。
en: Could not delete the corresponding sample written by Maren from Apple Health.
es: No se pudo eliminar de Salud de Apple la muestra correspondiente escrita por Maren.
ja: Apple Healthから、Marenが書き込んだ該当するデータを削除できませんでした。
ko: Apple 건강에서 Maren이 쓴 해당 샘플을 삭제하지 못했어요.
zh_hant: 未能從 Apple Health 刪除由 Maren 寫入的對應樣本。

source: 未能完成所选类型的请求或读取,本机数据未改动。Apple 健康可能不会向 Maren 暴露读权限是否被拒绝,请在「健康」App 中检查。
en: The selected types could not be requested or read; local data was unchanged. Apple Health may not tell Maren whether read access was denied. Check permissions in the Health app.
es: No se pudieron solicitar ni leer los tipos seleccionados; los datos locales no han cambiado. Puede que Salud de Apple no le indique a Maren si se ha denegado el acceso de lectura. Revisa los permisos en la app Salud.
ja: 選択した種類の許可申請または読み込みができませんでした。ローカルデータは変更されていません。Apple Healthは読み取り権限が拒否されたかどうかをMarenに伝えない場合があります。「ヘルスケア」Appで権限をご確認ください。
ko: 선택한 유형을 요청하거나 읽지 못했어요. 로컬 데이터는 바뀌지 않았어요. Apple 건강은 읽기 권한이 거부되었는지 Maren에 알려 주지 않을 수 있으니, 건강 앱에서 권한을 확인하세요.
zh_hant: 未能完成所選型別的請求或讀取,本機資料未改動。Apple 健康可能不會向 Maren 暴露讀許可權是否被拒絕,請在「健康」App 中檢查。

source: 未能生成完整导出文件,请检查设备存储空间后重试。
en: Could not create a complete export. Check device storage and try again.
es: No se pudo crear una exportación completa. Comprueba el almacenamiento del dispositivo e inténtalo de nuevo.
ja: 完全なエクスポートファイルを作成できませんでした。デバイスの空き容量を確認して、もう一度お試しください。
ko: 전체 내보내기 파일을 만들지 못했어요. 기기 저장 공간을 확인하고 다시 시도해 주세요.
zh_hant: 未能生成完整匯出檔案,請檢查裝置儲存空間後重試。

source: 未能生成导出文件,请检查设备存储空间后重试。
en: Couldn't create the export file. Check your device storage and try again.
es: No se pudo crear el archivo de exportación. Comprueba el almacenamiento del dispositivo e inténtalo de nuevo.
ja: エクスポートファイルを作成できませんでした。デバイスの空き容量を確認して、もう一度お試しください。
ko: 내보내기 파일을 만들지 못했어요. 기기 저장 공간을 확인하고 다시 시도해 주세요.
zh_hant: 未能生成匯出檔案,請檢查裝置儲存空間後重試。

source: 未能生成报告 PDF,请检查设备存储空间后重试。
en: Failed to generate report PDF. Please check device storage and try again.
es: No se pudo generar el PDF del informe. Comprueba el almacenamiento del dispositivo e inténtalo de nuevo.
ja: レポートのPDFを生成できませんでした。デバイスの空き容量を確認して、もう一度お試しください。
ko: 리포트 PDF를 만들지 못했어요. 기기 저장 공간을 확인하고 다시 시도해 주세요.
zh_hant: 未能生成報告 PDF,請檢查裝置儲存空間後重試。

source: 未能获得「健康」App 的经期读写授权。你可以在 系统设置 → 隐私与安全性 → 健康 → Maren 中检查授权。
en: Maren didn't get permission to read and write period data in the Health app. You can check it in Settings → Privacy & Security → Health → Maren.
es: Maren no tiene permiso para leer y escribir datos de periodo en la app Salud. Puedes revisarlo en Ajustes → Privacidad y seguridad → Salud → Maren.
ja: Marenは「ヘルスケア」Appで生理データを読み書きする権限を取得できませんでした。設定 → プライバシーとセキュリティ → ヘルスケア → Maren で確認できます。
ko: Maren에 건강 앱의 생리 데이터를 읽고 쓸 권한이 없어요. 설정 → 개인정보 보호 및 보안 → 건강 → Maren에서 확인할 수 있어요.
zh_hant: 未能獲得「健康」App 的經期讀寫授權。你可以在 系統設定 → 隱私與安全性 → 健康 → Maren 中檢查授權。

source: 未获得 HealthKit 写入授权
en: HealthKit write authorization not granted
es: No se ha concedido la autorización de escritura en HealthKit
ja: HealthKitの書き込み権限が許可されていません
ko: 건강 앱 쓰기 권한이 허용되지 않았어요
zh_hant: 未獲得 HealthKit 寫入授權

source: 未记录
en: Not logged
es: Sin registrar
ja: 未記録
ko: 기록 안 함
zh_hant: 未記錄

source: 未设置避孕记录
en: Contraception not set
es: Anticoncepción sin configurar
ja: 避妊方法が未設定です
ko: 피임 방법을 설정하지 않았어요
zh_hant: 未設定避孕記錄

source: 未设置避孕记录。
en: Contraception not set.
es: Anticoncepción sin configurar.
ja: 避妊方法が未設定です。
ko: 피임 방법을 설정하지 않았어요.
zh_hant: 未設定避孕記錄。

source: 未选择
en: Not set
es: Sin configurar
ja: 未設定
ko: 설정 안 함
zh_hant: 未選擇

source: 未选择同步类型
en: No sync type selected
es: No has elegido ningún tipo de sincronización
ja: 同期する種類が選択されていません
ko: 선택한 동기화 유형이 없어요
zh_hant: 未選擇同步型別

source: 本周共 %lld 天经期记录。
en: %lld period-recorded days this week.
es: %lld días con periodo registrado esta semana.
ja: 今週、生理を記録した日は%lld日です。
ko: 이번 주에 생리를 기록한 날은 %lld일이에요.
zh_hant: 本週共 %lld 天經期記錄。
